SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-76017-B

Comment( British Rail Standard 4MT 2-6-0 Locomotive )
Comment( ******RESISTANCE BASED ON STILL WIND*******)

Comment( **Known Parameters Required for OR - Wagon Section**)

Comment( ************** General Information***************** )
Type ( Engine )
WagonShape ( DR_BR_4MT_76017.s )
Size  ( 2.634666m 4.151885m 9.678091m )
Mass ( 59.75t-uk )

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Break ( 710kN 1220kN )
			r0 ( 0cm 10cm )
		)
		CouplingHasRigidConnection (1)
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Break ( 600kN 1000kN )
			r0 ( 10cm 20cm )
			)
	CouplingHasRigidConnection (0)
	)
	
Comment( ************ Brakes, Type, Force, etc *************** )
BrakeSystemType ( "Vacuum_single_pipe" )
MaxBrakeForce ( 160kN ) Comment(Brake % 53.4 WWO CoF 0.5)
MaxHandbrakeForce ( 0kN ) Comment(ctn calc)
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21 ) 

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121)

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.7m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 14.0ft 0.0in )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

Comment( CN 1990 DWx18)
ORTSDavis_A ( 5291 )
ORTSDavis_B ( 19.98 )
ORTSDavis_C ( 5.235 )

ORTSWagonFrontalArea (98)
ORTSDavisDragConstant (0.0024)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)

Lights	( 1
			Light	(
			comment( Front White Lamp Position a )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 2 ) Service ( 2 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddddddd )
					Position ( 0 3.25 3.84 ) 
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.65 )
					)
				)
			)
		)

Comment( ******* Miscellaneous Wagon Information************ )

FreightAnim ( "..\\common.crew\\LIB_2\\Std4b.s" 0 3.0 0.0 )

Comment (Passenger View)	
	Inside (
	WagonShape ( DR_BR_4MT_76017.s )
        PassengerCabinHeadPos ( 1.423 3.0 -3.44 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)
Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardeng.sms" )
)



Engine ( OR-76017-B

Comment( *Known Parameters Required for OR - Engine Section*)

Comment (Section for Engine Effects - Steam Emissions, Stack) 

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)

			WhistleFX
			(
				0 3.8 -2.7
				0 1 0
				0.15
			)

			SafetyValvesFX
			(
				0.154 4.0 -2.4
				0 1 0
				0.2
			)
			SafetytValvesFX
			(
				-0.154 4.0 -2.7
				0 1 0
				0.2
			)
			StackFX
			(
				0 4.32 2.6
				0 1 0
				0.3
			)
			StackFX
			(
				0 4.32 2.6
				0 1 0
				0.25
			)
			StackFX
			(
				0 4.32 2.6
				0 1 0
				0.25
			)
			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-1 -1 -1
				0.05
			)

			Injectors2FX
			(
				1.05 0.85 -4.2
				0 -1 -1
				0.15
			)
			Injectors1FX
			(
				1.05 0.85 -4.4
				0 -1 -1
				0.15
			)

			CylindersFX
			(
				-1.052 0.801 3.3
				0 0.1 1
				0.19
			)

			CylindersFX
			(
				1.052 0.801 3.3
				0 0.1 1
				0.19
			)
		)
	)

Wagon ( OR-76017-B )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 31.5in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 50.45t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 159ft^3 ) 
ORTSEvaporationArea ( 1206ft^2 )
ORTSSuperheatArea ( 247ft^2 )
MaxBoilerPressure ( 225psi )
MaxSteamHeatingPressure ( 80psi )

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 2 )
CylinderStroke ( 26in ) 
CylinderDiameter ( 17.5in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13700btu/lb )
ORTSGrateArea ( 23ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ********************* Fuel ************************* )

MaxTenderCoalMass ( 6t-uk )
MaxTenderWaterMass ( 35000lb )
IsTenderRequired( 1 )	

Comment(       ********ADVANCED PARAMETERS**********      )
Comment( Remove comment statement and outer brackets as required)

ORTSBoilerEvaporationRate ( 15.3 ) Comment(to give max steam rate 18600lb/hr)



ORTSMaxIndicatedHorsepower ( 1200.0hp )

ORTSMaxSuperheatTemperature ( 280.0 )

Comment(ORTSSuperheatCutoffPressureFactor ( 65.0 )) Comment(Default 55)

Comment(ORTSBoilerEfficiency( 0.0 0.9  185.0 0.45 )) Comment(Similar to B1 Report)

ORTSBoilerEfficiency( 0.0 0.905  190.0 0.4525 )Comment(From 4MT Report)

ORTSBurnRate( 0.0 10.0   6675.0 690.0   9345.0 965.0   11480.0 1260.0   13880.0 1580.0   16000.0 1935.0   18150.0 2335.0  20292.0 2790.0  22161.0 3250.0  25365.0 4000.0 ) Comment (From 4-6-0 4MT Report)

ORTSCylinderInitialPressureDrop ( 0.0 0.99 350 0.98 )


Comment(ORTSCylinderBackPressure ( 0.0 0.0  3000 12.0  ))

    
Comment ( *******************Brake System ******************** )   

TrainBrakesControllerMinSystemPressure( 0 )
TrainBrakesControllerMaxSystemPressure( 21 )
BrakeEquipmentType ( "Vacuum_brake, Handbrake " )
BrakeSystemType ( "Vacuum_single_pipe" )

Comment(************Train Control Sysytem (if used)**********        

Includes Monitoring of Overspeed, Vigilance, Emergency Braking 

*************************************************************)

     
Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch ( 0.0 0 TrainBrakesControllerReleaseStart )
Notch ( 0.1 0 TrainBrakesControllerRunningStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )
            
Brake_Hand ( 0 1 0.0125 0
	NumNotches ( 0 ))
FireDoor ( 4 4 0.4 0
	NumNotches ( 0 ))
Sanding( 0 1 0 )
Blower ( 0 1 0.025 0.2
	NumNotches ( 0 ))
ORTSSteamHeat( 0 1 0.0125 0.5 )
Shovel ( 0 1 0.1 0
	NumNotches ( 0 ))
DampersFront ( 0 1 0.1 1
	NumNotches ( 0 ))
DampersBack ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector1Steam ( 0 1 0 )
Injector2Steam ( 0 1 0 )
Injector1Water ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector2Water ( 0 1 0.1 0
	NumNotches ( 0 ))
CylinderCocks ( 0 1 1 )
Whistle ( 0 1 0 )
WaterScoop ( 0 1 0 )
SmallEjectorOrCompressor( 0 1 1 )
BellToggle( 0 1 0 )
Headlights( 0 1 0 )
)

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( Standard4b.cvf )
HeadOut (  -1.423 3.0 -3.44 )
Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardcab.sms" )
Name ( "76017 BR 4MT 2-6-0, Local Passenger, BR2 Tender, Coal 6t, Water\n"+ " 3500gal" )
Description (
"The class was designed at the ex-LNER works at Doncaster which was also responsible for building 25 of the 115-strong class. The remaining 90 were split between Horwich and Derby Works.\n"+
"\n"+
"The last in the series, No.76114, was also the final steam engine to be constructed at the 'Plant' (as Doncaster works was known). The Standard Four Mogul was essentially a standardised version of the LMS Ivatt Class 4, and was primarily intended for freight use.\n"+
"\n"+
"With its 5-foot-3-inch (1.60 m) diameter driving wheels this sixth of the BR standard designs was clearly biased towards freight working. An axle-loading of only 16 long tons 15 cwt (37,500 lb or 17 t) meant its route availability was virtually unrestricted.\n"+
"\n"+
"The Eastern Region divided its 15 between two London depots. Five went to Stratford on the ex-Great Eastern section, and the remainder to the one-time Great Central depot at Neasden. Made redundant by dieselisation the Stratford engines were transferred to the Southern and arrived at Brighton.\n"+
"\n"+
"At first the North Eastern Region scattered its 13-strong allocation far and wide: Darlington, Gateshead, Hull, Sunderland and York. Later all were concentrated at either Kirkby Stephen or West Auckland to work over the Stainmore route whose viaducts had severe weight restrictions. Like their small cousins the 2MT 2-6-0 class the Moguls were ideal for working the line. They worked coal trains as well as passenger services and were a regular choice for excursions from Tyneside to the Lancashire coast resorts.")
)
